example.org
#+SETUPFILE: /Users/cche/Dropbox/_emacs/org-utils/org_export/eos/default.setup
#+TITLE: Comprehensive Org-Mode Theme Example
#+AUTHOR: ChongChong He
#+DATE: 2025-07-06 Sunday
#+DESCRIPTION: A comprehensive example showcasing all styled org-mode elements
#+KEYWORDS: org-mode, html, export, theme, examples
#+LANGUAGE: en

* Introduction

This document demonstrates the comprehensive styling capabilities of the org-mode HTML export theme. It includes examples of all major org-mode elements and features.

** Text Formatting

Here are examples of various text formatting options:

- *Bold text* stands out clearly
- /Italic text/ provides emphasis
- _Underlined text_ is distinct
- +Strikethrough text+ shows deletions
- ~Inline code~ has monospace formatting
- =Verbatim text= preserves formatting
- Super^{script} and Sub_{script} work too

** Links and References

- [[https://orgmode.org][External link to Org-Mode]]
- [[file:README.md][Internal link to README]]
- [[#tables][Link to Tables section below]]
- Plain URL: https://www.gnu.org/software/emacs/

* Headings Hierarchy

** Second Level Heading

*** Third Level Heading

**** Fourth Level Heading

***** Fifth Level Heading

****** Sixth Level Heading

******* Seventh Level Heading

This demonstrates all heading levels and their styling.

* Lists and Organization

** Unordered Lists

- First item
- Second item with *bold* text
- Third item with /italic/ text
  - Nested item
  - Another nested item
    - Deeply nested item
- Fourth item with ~inline code~

** Ordered Lists

1. First numbered item
2. Second numbered item
3. Third numbered item
   1. Nested numbered item
   2. Another nested item
      1. Deeply nested numbered item
4. Fourth numbered item

** Mixed Lists

1. First item
   - Nested bullet
   - Another bullet
2. Second item
   1. Nested number
   2. Another number
3. Third item

** Definition Lists

- Term 1 :: Definition of the first term
- Term 2 :: Definition of the second term with *formatting*
- Long Term :: This is a longer definition that demonstrates how the styling handles multiple lines and various formatting options

* Tables
  :PROPERTIES:
  :CUSTOM_ID: tables
  :END:

** Basic Table

| Language | Paradigm     | Year | Popular |
|----------+--------------+------+---------|
| Python   | Multi        | 1991 | Yes     |
| C        | Procedural   | 1972 | Yes     |
| Haskell  | Functional   | 1990 | No      |
| Java     | Object       | 1995 | Yes     |
| Lisp     | Functional   | 1958 | No      |

** Table with Alignment

|   Number | Description           | Value |
|----------+-----------------------+-------|
|      <r> | <l>                   |   <r> |
|        1 | First value           |  10.5 |
|       42 | Answer to everything  | 100.0 |
|      999 | Large number          |   0.1 |

* Code Examples

** SQL Query

#+BEGIN_SRC sql
-- Complex SQL query example
SELECT 
    u.name,
    u.email,
    COUNT(p.id) as post_count,
    AVG(p.rating) as avg_rating
FROM users u
LEFT JOIN posts p ON u.id = p.user_id
WHERE u.created_at > '2023-01-01'
GROUP BY u.id, u.name, u.email
HAVING COUNT(p.id) > 5
ORDER BY avg_rating DESC, post_count DESC
LIMIT 10;
#+END_SRC

** Calculator Expressions

#+BEGIN_SRC calc :results output
M = 120 M_sun, r = 1 AU, v = sqrt(G M / r)
circ = 2 pi r, t = circ / v
v in km/s, t in yr
#+END_SRC

#+RESULTS:
: v = 326.2749517 km / s
: t = 0.09128881703 yr

