example.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-06 Sun 02:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Comprehensive Org-Mode Theme Example</title>
<meta name="author" content="ChongChong He" />
<meta name="description" content="A comprehensive example showcasing all styled org-mode elements" />
<meta name="keywords" content="org-mode, html, export, theme, examples" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/chongchonghe/modern-theme-for-org-export@main/modernorg.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Comprehensive Org-Mode Theme Example</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8623e9f">Introduction</a>
<ul>
<li><a href="#orga416c86">Text Formatting</a></li>
<li><a href="#org963e695">Links and References</a></li>
</ul>
</li>
<li><a href="#org949e6ad">Headings Hierarchy</a>
<ul>
<li><a href="#orgae8fbdd">Second Level Heading</a></li>
</ul>
</li>
<li><a href="#org2e57352">Lists and Organization</a>
<ul>
<li><a href="#org7ffa2de">Unordered Lists</a></li>
<li><a href="#org45e9334">Ordered Lists</a></li>
<li><a href="#org4694482">Mixed Lists</a></li>
<li><a href="#org7aac584">Definition Lists</a></li>
</ul>
</li>
<li><a href="#tables">Tables</a>
<ul>
<li><a href="#orge89b252">Basic Table</a></li>
<li><a href="#org8178b55">Table with Alignment</a></li>
</ul>
</li>
<li><a href="#orgf16ffe6">Code Examples</a>
<ul>
<li><a href="#orgb22859d">SQL Query</a></li>
<li><a href="#orgd331b1e">Calculator Expressions</a></li>
<li><a href="#org82a94dc">Example Block</a></li>
<li><a href="#orgb398fb5">Verbatim Block</a></li>
<li><a href="#orgd25240b">Shell Script</a></li>
<li><a href="#org01d6c31">JavaScript Code</a></li>
<li><a href="#org4dfbd93">Python Code with Results</a></li>
</ul>
</li>
<li><a href="#org44ba910">Task Management</a>
<ul>
<li><a href="#org4ee3e16"><span class="todo TODO">TODO</span> Items</a></li>
</ul>
</li>
<li><a href="#org6568b1d">Blockquotes and Citations</a></li>
<li><a href="#orge514c22">Timestamps and Scheduling</a>
<ul>
<li><a href="#org1fa1ce2">Meeting Schedule</a></li>
<li><a href="#org3d2eeb4">Time Tracking</a></li>
</ul>
</li>
<li><a href="#orgd8a7a9c">Tags and Categories</a>
<ul>
<li><a href="#org78a67e5">Programming Languages</a></li>
<li><a href="#org5db8b66">Research Topics</a></li>
</ul>
</li>
<li><a href="#org56daac7">Special Elements</a>
<ul>
<li><a href="#org971fd12">Source Code References</a></li>
<li><a href="#org8063a5c">Mathematical Expressions</a></li>
<li><a href="#org2d43754">Keyboard Shortcuts</a></li>
</ul>
</li>
<li><a href="#org053e394">Advanced Features</a>
<ul>
<li><a href="#org62835c1">Property Drawers</a></li>
<li><a href="#org14ba166">Source Code Blocks with Options</a></li>
</ul>
</li>
<li><a href="#org6c4a9b2">Conclusion</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8623e9f" class="outline-2">
<h2 id="org8623e9f">Introduction</h2>
<div class="outline-text-2" id="text-org8623e9f">
<p>
This document demonstrates the comprehensive styling capabilities of the org-mode HTML export theme. It includes examples of all major org-mode elements and features.
</p>
</div>
<div id="outline-container-orga416c86" class="outline-3">
<h3 id="orga416c86">Text Formatting</h3>
<div class="outline-text-3" id="text-orga416c86">
<p>
Here are examples of various text formatting options:
</p>

<ul class="org-ul">
<li><b>Bold text</b> stands out clearly</li>
<li><i>Italic text</i> provides emphasis</li>
<li><span class="underline">Underlined text</span> is distinct</li>
<li><del>Strikethrough text</del> shows deletions</li>
<li><code>Inline code</code> has monospace formatting</li>
<li><code>Verbatim text</code> preserves formatting</li>
<li>Super<sup>script</sup> and Sub<sub>script</sub> work too</li>
</ul>
</div>
</div>
<div id="outline-container-org963e695" class="outline-3">
<h3 id="org963e695">Links and References</h3>
<div class="outline-text-3" id="text-org963e695">
<ul class="org-ul">
<li><a href="https://orgmode.org">External link to Org-Mode</a></li>
<li><a href="README.md">Internal link to README</a></li>
<li><a href="#tables">Link to Tables section below</a></li>
<li>Plain URL: <a href="https://www.gnu.org/software/emacs/">https://www.gnu.org/software/emacs/</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org949e6ad" class="outline-2">
<h2 id="org949e6ad">Headings Hierarchy</h2>
<div class="outline-text-2" id="text-org949e6ad">
</div>
<div id="outline-container-orgae8fbdd" class="outline-3">
<h3 id="orgae8fbdd">Second Level Heading</h3>
<div class="outline-text-3" id="text-orgae8fbdd">
</div>
<ul class="org-ul">
<li><a id="org6331ad3"></a>Third Level Heading<br />
<ul class="org-ul">
<li><a id="org90e1fd5"></a>Fourth Level Heading<br />
<ul class="org-ul">
<li><a id="org02f9268"></a>Fifth Level Heading<br />
<ul class="org-ul">
<li><a id="orge610b90"></a>Sixth Level Heading<br />
<ul class="org-ul">
<li><a id="org2336315"></a>Seventh Level Heading<br />
<div class="outline-text-8" id="text-org2336315">
<p>
This demonstrates all heading levels and their styling.
</p>
</div>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2e57352" class="outline-2">
<h2 id="org2e57352">Lists and Organization</h2>
<div class="outline-text-2" id="text-org2e57352">
</div>
<div id="outline-container-org7ffa2de" class="outline-3">
<h3 id="org7ffa2de">Unordered Lists</h3>
<div class="outline-text-3" id="text-org7ffa2de">
<ul class="org-ul">
<li>First item</li>
<li>Second item with <b>bold</b> text</li>
<li>Third item with <i>italic</i> text
<ul class="org-ul">
<li>Nested item</li>
<li>Another nested item
<ul class="org-ul">
<li>Deeply nested item</li>
</ul></li>
</ul></li>
<li>Fourth item with <code>inline code</code></li>
</ul>
</div>
</div>
<div id="outline-container-org45e9334" class="outline-3">
<h3 id="org45e9334">Ordered Lists</h3>
<div class="outline-text-3" id="text-org45e9334">
<ol class="org-ol">
<li>First numbered item</li>
<li>Second numbered item</li>
<li>Third numbered item
<ol class="org-ol">
<li>Nested numbered item</li>
<li>Another nested item
<ol class="org-ol">
<li>Deeply nested numbered item</li>
</ol></li>
</ol></li>
<li>Fourth numbered item</li>
</ol>
</div>
</div>
<div id="outline-container-org4694482" class="outline-3">
<h3 id="org4694482">Mixed Lists</h3>
<div class="outline-text-3" id="text-org4694482">
<ol class="org-ol">
<li>First item
<ul class="org-ul">
<li>Nested bullet</li>
<li>Another bullet</li>
</ul></li>
<li>Second item
<ol class="org-ol">
<li>Nested number</li>
<li>Another number</li>
</ol></li>
<li>Third item</li>
</ol>
</div>
</div>
<div id="outline-container-org7aac584" class="outline-3">
<h3 id="org7aac584">Definition Lists</h3>
<div class="outline-text-3" id="text-org7aac584">
<dl class="org-dl">
<dt>Term 1</dt><dd>Definition of the first term</dd>
<dt>Term 2</dt><dd>Definition of the second term with <b>formatting</b></dd>
<dt>Long Term</dt><dd>This is a longer definition that demonstrates how the styling handles multiple lines and various formatting options</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-tables" class="outline-2">
<h2 id="tables">Tables</h2>
<div class="outline-text-2" id="text-tables">
</div>
<div id="outline-container-orge89b252" class="outline-3">
<h3 id="orge89b252">Basic Table</h3>
<div class="outline-text-3" id="text-orge89b252">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Language</th>
<th scope="col" class="org-left">Paradigm</th>
<th scope="col" class="org-right">Year</th>
<th scope="col" class="org-left">Popular</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Python</td>
<td class="org-left">Multi</td>
<td class="org-right">1991</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">Procedural</td>
<td class="org-right">1972</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Haskell</td>
<td class="org-left">Functional</td>
<td class="org-right">1990</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left">Java</td>
<td class="org-left">Object</td>
<td class="org-right">1995</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Lisp</td>
<td class="org-left">Functional</td>
<td class="org-right">1958</td>
<td class="org-left">No</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8178b55" class="outline-3">
<h3 id="org8178b55">Table with Alignment</h3>
<div class="outline-text-3" id="text-org8178b55">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Number</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-right">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">First value</td>
<td class="org-right">10.5</td>
</tr>

<tr>
<td class="org-right">42</td>
<td class="org-left">Answer to everything</td>
<td class="org-right">100.0</td>
</tr>

<tr>
<td class="org-right">999</td>
<td class="org-left">Large number</td>
<td class="org-right">0.1</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgf16ffe6" class="outline-2">
<h2 id="orgf16ffe6">Code Examples</h2>
<div class="outline-text-2" id="text-orgf16ffe6">
</div>
<div id="outline-container-orgb22859d" class="outline-3">
<h3 id="orgb22859d">SQL Query</h3>
<div class="outline-text-3" id="text-orgb22859d">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #7a808b;">-- </span><span style="color: #7a808b;">Complex SQL query example</span>
<span style="color: #10b1fe;">SELECT</span> 
    u.<span style="color: #10b1fe;">name</span>,
    u.email,
    <span style="color: #3fc56b;">COUNT</span>(p.id) <span style="color: #10b1fe;">as</span> post_count,
    <span style="color: #3fc56b;">AVG</span>(p.rating) <span style="color: #10b1fe;">as</span> avg_rating
<span style="color: #10b1fe;">FROM</span> users u
<span style="color: #10b1fe;">LEFT</span> <span style="color: #10b1fe;">JOIN</span> posts p <span style="color: #10b1fe;">ON</span> u.id = p.user_id
<span style="color: #10b1fe;">WHERE</span> u.created_at &gt; <span style="color: #f9c859;">'2023-01-01'</span>
<span style="color: #10b1fe;">GROUP</span> <span style="color: #10b1fe;">BY</span> u.id, u.<span style="color: #10b1fe;">name</span>, u.email
<span style="color: #10b1fe;">HAVING</span> <span style="color: #3fc56b;">COUNT</span>(p.id) &gt; <span style="color: #ff78f8; font-weight: bold;">5</span>
<span style="color: #10b1fe;">ORDER</span> <span style="color: #10b1fe;">BY</span> avg_rating <span style="color: #10b1fe;">DESC</span>, post_count <span style="color: #10b1fe;">DESC</span>
<span style="color: #10b1fe;">LIMIT</span> <span style="color: #ff78f8; font-weight: bold;">10</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd331b1e" class="outline-3">
<h3 id="orgd331b1e">Calculator Expressions</h3>
<div class="outline-text-3" id="text-orgd331b1e">
<div class="org-src-container">
<pre class="src src-calc">M = 120 M_sun, r = 1 AU, v = sqrt(G M / r)
circ = 2 pi r, t = circ / v
v in km/s, t in yr
</pre>
</div>

<pre class="example">
v = 326.2749517 km / s
t = 0.09128881703 yr
</pre>
</div>
</div>
