example.org
** Example Block

#+BEGIN_EXAMPLE
This is an example block that preserves formatting exactly as written.
It can contain:
  - Indented text
  - Special characters: & < > " '
  - Code-like content without syntax highlighting
  - ASCII art:
    ┌─────────────┐
    │  Example    │
    │   Block     │
    └─────────────┘
#+END_EXAMPLE

** Verbatim Block

#+BEGIN_VERBATIM
This is a verbatim block.
All formatting is preserved exactly.
No interpretation of org-mode syntax occurs here.
*This will not be bold*
~This will not be code~
#+END_VERBATIM

** Shell Script

#+BEGIN_SRC bash :results output :exports both
#!/bin/bash
echo "System Information:"
echo "=================="
echo "Date: $(date)"
echo "User: $(whoami)"
echo "Working directory: $(pwd)"
echo "Files in current directory:"
ls -la | head -5
#+END_SRC

#+RESULTS:
: System Information:
: ==================
: Date: Sun Jan 15 12:34:56 PST 2024
: User: user
: Working directory: /home/user/documents
: Files in current directory:
: total 48

** JavaScript Code

#+BEGIN_SRC javascript
// Modern JavaScript example
const fibonacci = (n) => {
    if (n <= 1) return n;
    return fibonacci(n - 1) + fibonacci(n - 2);
};

// Generate Fibonacci sequence
const fibSequence = Array.from({length: 10}, (_, i) => fibonacci(i));
console.log('Fibonacci sequence:', fibSequence);

// Arrow function with destructuring
const processData = ({name, age, city}) => {
    return `${name} is ${age} years old and lives in ${city}`;
};

const person = {name: 'Alice', age: 30, city: 'New York'};
console.log(processData(person));
#+END_SRC

** Python Code with Results

#+BEGIN_SRC python :results output :exports both
import numpy as np
import matplotlib.pyplot as plt

# Generate sample data
x = np.linspace(0, 2*np.pi, 100)
y = np.sin(x)

print("Sample data generated:")
print(f"x range: {x.min():.2f} to {x.max():.2f}")
print(f"y range: {y.min():.2f} to {y.max():.2f}")

# Simple calculation
result = np.trapz(y, x)
print(f"Integral of sin(x): {result:.6f}")
#+END_SRC

#+RESULTS:
: Sample data generated:
: x range: 0.00 to 6.28
: y range: -1.00 to 1.00
: Integral of sin(x): 0.000000

* Task Management

** TODO Items

*** TODO Complete the documentation
    SCHEDULED: <2024-01-20 Sat>
    - [ ] Write introduction
    - [X] Create examples
    - [ ] Add more code samples
    - [ ] Review and finalize

*** DONE Implement theme toggle
    CLOSED: [2024-01-15 Mon 10:30]
    - [X] Add CSS variables
    - [X] Create toggle button
    - [X] Add JavaScript functionality

*** WAITING Review from team
    SCHEDULED: <2024-01-25 Thu>
    Waiting for feedback from the development team.

*** SOMEDAY Add more features
    Ideas for future enhancements:
    - Print stylesheet
    - Mobile optimizations
    - Additional color themes

* Blockquotes and Citations

#+BEGIN_QUOTE
This is a blockquote. It can contain multiple paragraphs and is useful for highlighting important information or quotes from other sources.

The blockquote can span multiple lines and includes proper styling to distinguish it from regular paragraphs. It may include /italic/ or *bold* text as well.

-- Attribution can be added at the end
#+END_QUOTE

* Timestamps and Scheduling

** Meeting Schedule

- Project kickoff: <2024-01-15 Mon 09:00>
- Weekly standup: <2024-01-22 Mon 09:00 +1w>
- Deadline: <2024-02-01 Thu>
- Review period: <2024-01-25 Thu>--<2024-01-31 Wed>

** Time Tracking

CLOCK: [2024-01-15 Mon 08:00]--[2024-01-15 Mon 10:30] =>  2:30

* Tags and Categories                                              :example:

** Programming Languages                                        :programming:
   
*** Python                                                     :python:data:
    Excellent for data science and web development.
    
*** JavaScript                                                  :javascript:
    Essential for web development.
    
*** Rust                                                    :rust:systems:
    Great for systems programming.

** Research Topics                                              :research:

*** Machine Learning                                               :ai:ml:
    Current focus on deep learning architectures.
    
