example.html
<div id="outline-container-org82a94dc" class="outline-3">
<h3 id="org82a94dc">Example Block</h3>
<div class="outline-text-3" id="text-org82a94dc">
<pre class="example" id="org8c1b3a4">
This is an example block that preserves formatting exactly as written.
It can contain:
  - Indented text
  - Special characters: &amp; &lt; &gt; " '
  - Code-like content without syntax highlighting
  - ASCII art:
    ┌─────────────┐
    │  Example    │
    │   Block     │
    └─────────────┘
</pre>
</div>
</div>
<div id="outline-container-orgb398fb5" class="outline-3">
<h3 id="orgb398fb5">Verbatim Block</h3>
<div class="outline-text-3" id="text-orgb398fb5">
<div class="VERBATIM" id="org97ec200">
<p>
This is a verbatim block.
All formatting is preserved exactly.
No interpretation of org-mode syntax occurs here.
<b>This will not be bold</b>
<code>This will not be code</code>
</p>

</div>
</div>
</div>
<div id="outline-container-orgd25240b" class="outline-3">
<h3 id="orgd25240b">Shell Script</h3>
<div class="outline-text-3" id="text-orgd25240b">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #7a808b;">#</span><span style="color: #7a808b;">!/bin/</span><span style="color: #10b1fe;">bash</span>
<span style="color: #ff6480;">echo</span> <span style="color: #f9c859;">"System Information:"</span>
<span style="color: #ff6480;">echo</span> <span style="color: #f9c859;">"=================="</span>
<span style="color: #ff6480;">echo</span> <span style="color: #f9c859;">"Date: </span><span style="color: #7a82da; font-weight: bold;">$(</span><span style="color: #7a82da; font-weight: bold;">date</span><span style="color: #7a82da; font-weight: bold;">)</span><span style="color: #f9c859;">"</span>
<span style="color: #ff6480;">echo</span> <span style="color: #f9c859;">"User: </span><span style="color: #7a82da; font-weight: bold;">$(whoami)</span><span style="color: #f9c859;">"</span>
<span style="color: #ff6480;">echo</span> <span style="color: #f9c859;">"Working directory: </span><span style="color: #7a82da; font-weight: bold;">$(</span><span style="color: #7a82da; font-weight: bold;">pwd</span><span style="color: #7a82da; font-weight: bold;">)</span><span style="color: #f9c859;">"</span>
<span style="color: #ff6480;">echo</span> <span style="color: #f9c859;">"Files in current directory:"</span>
<span style="color: #ff6480;">ls</span> -la | head -5
</pre>
</div>

<pre class="example">
System Information:
==================
Date: Sun Jan 15 12:34:56 PST 2024
User: user
Working directory: /home/user/documents
Files in current directory:
total 48
</pre>
</div>
</div>
<div id="outline-container-org01d6c31" class="outline-3">
<h3 id="org01d6c31">JavaScript Code</h3>
<div class="outline-text-3" id="text-org01d6c31">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #7a808b;">// </span><span style="color: #7a808b;">Modern JavaScript example</span>
<span style="color: #10b1fe;">const</span> <span style="color: #8bcdef;">fibonacci</span> = (n) =&gt; {
    <span style="color: #10b1fe;">if</span> (n &lt;= <span style="color: #ff78f8; font-weight: bold;">1</span>) <span style="color: #10b1fe;">return</span> n;
    <span style="color: #10b1fe;">return</span> fibonacci(n - <span style="color: #ff78f8; font-weight: bold;">1</span>) + fibonacci(n - <span style="color: #ff78f8; font-weight: bold;">2</span>);
};

<span style="color: #7a808b;">// </span><span style="color: #7a808b;">Generate Fibonacci sequence</span>
<span style="color: #10b1fe;">const</span> <span style="color: #8bcdef;">fibSequence</span> = Array.from({length: <span style="color: #ff78f8; font-weight: bold;">10</span>}, (_, i) =&gt; fibonacci(i));
console.log(<span style="color: #f9c859;">'Fibonacci sequence:'</span>, fibSequence);

<span style="color: #7a808b;">// </span><span style="color: #7a808b;">Arrow function with destructuring</span>
<span style="color: #10b1fe;">const</span> <span style="color: #8bcdef;">processData</span> = ({name, age, city}) =&gt; {
    <span style="color: #10b1fe;">return</span> <span style="color: #f9c859;">`${name} is ${age} years old and lives in ${city}`</span>;
};

<span style="color: #10b1fe;">const</span> <span style="color: #8bcdef;">person</span> = {name: <span style="color: #f9c859;">'Alice'</span>, age: <span style="color: #ff78f8; font-weight: bold;">30</span>, city: <span style="color: #f9c859;">'New York'</span>};
console.log(processData(person));
</pre>
</div>
</div>
</div>
<div id="outline-container-org4dfbd93" class="outline-3">
<h3 id="org4dfbd93">Python Code with Results</h3>
<div class="outline-text-3" id="text-org4dfbd93">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #10b1fe;">import</span> numpy <span style="color: #10b1fe;">as</span> np
<span style="color: #10b1fe;">import</span> matplotlib.pyplot <span style="color: #10b1fe;">as</span> plt

<span style="color: #7a808b;"># </span><span style="color: #7a808b;">Generate sample data</span>
<span style="color: #8bcdef;">x</span> <span style="color: #7a82da;">=</span> np.linspace(<span style="color: #ff78f8; font-weight: bold;">0</span>, <span style="color: #ff78f8; font-weight: bold;">2</span><span style="color: #7a82da;">*</span>np.pi, <span style="color: #ff78f8; font-weight: bold;">100</span>)
<span style="color: #8bcdef;">y</span> <span style="color: #7a82da;">=</span> np.sin(x)

<span style="color: #3fc56b;">print</span>(<span style="color: #f9c859;">"Sample data generated:"</span>)
<span style="color: #3fc56b;">print</span>(f<span style="color: #f9c859;">"x range: </span>{x.<span style="color: #3fc56b;">min</span>():.2f}<span style="color: #f9c859;"> to </span>{x.<span style="color: #3fc56b;">max</span>():.2f}<span style="color: #f9c859;">"</span>)
<span style="color: #3fc56b;">print</span>(f<span style="color: #f9c859;">"y range: </span>{y.<span style="color: #3fc56b;">min</span>():.2f}<span style="color: #f9c859;"> to </span>{y.<span style="color: #3fc56b;">max</span>():.2f}<span style="color: #f9c859;">"</span>)

<span style="color: #7a808b;"># </span><span style="color: #7a808b;">Simple calculation</span>
<span style="color: #8bcdef;">result</span> <span style="color: #7a82da;">=</span> np.trapz(y, x)
<span style="color: #3fc56b;">print</span>(f<span style="color: #f9c859;">"Integral of sin(x): </span>{result:.6f}<span style="color: #f9c859;">"</span>)
</pre>
</div>

<pre class="example">
Sample data generated:
x range: 0.00 to 6.28
y range: -1.00 to 1.00
Integral of sin(x): 0.000000
</pre>
</div>
</div>
</div>
<div id="outline-container-org44ba910" class="outline-2">
<h2 id="org44ba910">Task Management</h2>
<div class="outline-text-2" id="text-org44ba910">
</div>
<div id="outline-container-org4ee3e16" class="outline-3">
<h3 id="org4ee3e16"><span class="todo TODO">TODO</span> Items</h3>
<div class="outline-text-3" id="text-org4ee3e16">
</div>
<ul class="org-ul">
<li><a id="org32dfa5d"></a><span class="todo TODO">TODO</span> Complete the documentation<br />
<div class="outline-text-4" id="text-org32dfa5d">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Write introduction</li>
<li class="on"><code>[X]</code> Create examples</li>
<li class="off"><code>[&#xa0;]</code> Add more code samples</li>
<li class="off"><code>[&#xa0;]</code> Review and finalize</li>
</ul>
</div>
</li>
<li><a id="org31a2411"></a><span class="done DONE">DONE</span> Implement theme toggle<br />
<div class="outline-text-4" id="text-org31a2411">
<ul class="org-ul">
<li class="on"><code>[X]</code> Add CSS variables</li>
<li class="on"><code>[X]</code> Create toggle button</li>
<li class="on"><code>[X]</code> Add JavaScript functionality</li>
</ul>
</div>
</li>
<li><a id="orgb49824e"></a><span class="todo WAITING">WAITING</span> Review from team<br />
<div class="outline-text-4" id="text-orgb49824e">
<p>
Waiting for feedback from the development team.
</p>
</div>
</li>
<li><a id="orgd4c67b2"></a><span class="todo SOMEDAY">SOMEDAY</span> Add more features<br />
<div class="outline-text-4" id="text-orgd4c67b2">
<p>
Ideas for future enhancements:
</p>
<ul class="org-ul">
<li>Print stylesheet</li>
<li>Mobile optimizations</li>
<li>Additional color themes</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org6568b1d" class="outline-2">
<h2 id="org6568b1d">Blockquotes and Citations</h2>
<div class="outline-text-2" id="text-org6568b1d">
<blockquote>
<p>
This is a blockquote. It can contain multiple paragraphs and is useful for highlighting important information or quotes from other sources.
</p>

<p>
The blockquote can span multiple lines and includes proper styling to distinguish it from regular paragraphs. It may include <i>italic</i> or <b>bold</b> text as well.
</p>

<p>
&#x2013; Attribution can be added at the end
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orge514c22" class="outline-2">
<h2 id="orge514c22">Timestamps and Scheduling</h2>
<div class="outline-text-2" id="text-orge514c22">
</div>
<div id="outline-container-org1fa1ce2" class="outline-3">
<h3 id="org1fa1ce2">Meeting Schedule</h3>
<div class="outline-text-3" id="text-org1fa1ce2">
<ul class="org-ul">
<li>Project kickoff: <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-01-15 Mon 09:00&gt;</span></span></li>
<li>Weekly standup: <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-01-22 Mon 09:00 +1w&gt;</span></span></li>
<li>Deadline: <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-02-01 Thu&gt;</span></span></li>
<li>Review period: <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-01-25 Thu&gt;&#x2013;&lt;2024-01-31 Wed&gt;</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org3d2eeb4" class="outline-3">
<h3 id="org3d2eeb4">Time Tracking</h3>
<div class="outline-text-3" id="text-org3d2eeb4">
</div>
</div>
</div>
<div id="outline-container-orgd8a7a9c" class="outline-2">
<h2 id="orgd8a7a9c">Tags and Categories&#xa0;&#xa0;&#xa0;<span class="tag"><span class="example">example</span></span></h2>
<div class="outline-text-2" id="text-orgd8a7a9c">
</div>
<div id="outline-container-org78a67e5" class="outline-3">
<h3 id="org78a67e5">Programming Languages&#xa0;&#xa0;&#xa0;<span class="tag"><span class="programming">programming</span></span></h3>
<div class="outline-text-3" id="text-org78a67e5">
</div>
<ul class="org-ul">
<li><a id="orgcff3dd2"></a>Python&#xa0;&#xa0;&#xa0;<span class="tag"><span class="python">python</span>&#xa0;<span class="data">data</span></span><br />
<div class="outline-text-4" id="text-orgcff3dd2">
<p>
Excellent for data science and web development.
</p>
</div>
</li>
<li><a id="org51238d5"></a>JavaScript&#xa0;&#xa0;&#xa0;<span class="tag"><span class="javascript">javascript</span></span><br />
<div class="outline-text-4" id="text-org51238d5">
<p>
Essential for web development.
</p>
</div>
</li>
<li><a id="org5074fcd"></a>Rust&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rust">rust</span>&#xa0;<span class="systems">systems</span></span><br />
<div class="outline-text-4" id="text-org5074fcd">
<p>
Great for systems programming.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org5db8b66" class="outline-3">
<h3 id="org5db8b66">Research Topics&#xa0;&#xa0;&#xa0;<span class="tag"><span class="research">research</span></span></h3>
<div class="outline-text-3" id="text-org5db8b66">
</div>
<ul class="org-ul">
<li><a id="org6b0465a"></a>Machine Learning&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ai">ai</span>&#xa0;<span class="ml">ml</span></span><br />
<div class="outline-text-4" id="text-org6b0465a">
<p>
Current focus on deep learning architectures.
</p>
</div>
</li>
