example.org
*** Quantum Computing                                          :quantum:
    Exploring quantum algorithms and applications.

* Special Elements

** Footnotes

This text has a footnote[fn:1] and another one[fn:2].

** Source Code References

Here's how to reference code: see line 42 in src_python[:exports code]{fibonacci.py} 

** Mathematical Expressions

The quadratic formula: $x = \frac{-b \pm \sqrt{b^2 - 4ac}}{2a}$

Block equation:
$$\int_{-\infty}^{\infty} e^{-x^2} dx = \sqrt{\pi}$$

** Keyboard Shortcuts

- Save file: =C-x C-s=
- Export to HTML: =C-c C-e h h=
- Toggle theme: Click the 🌙/☀️ button

* Advanced Features

** Property Drawers

*** Configuration Settings
    :PROPERTIES:
    :CUSTOM_ID: config
    :CATEGORY: setup
    :EFFORT:   2:00
    :END:

** Source Code Blocks with Options

#+NAME: data-processing
#+BEGIN_SRC python :var data="sample.csv" :results file :exports both
import pandas as pd
import matplotlib.pyplot as plt

# Read data
df = pd.read_csv(data) if data.endswith('.csv') else pd.DataFrame({'x': [1,2,3], 'y': [4,5,6]})

# Create visualization
plt.figure(figsize=(8, 6))
plt.plot(df.index, df.iloc[:, 0], 'b-', label='Data')
plt.xlabel('Index')
plt.ylabel('Value')
plt.title('Data Visualization')
plt.legend()
plt.grid(True, alpha=0.3)
plt.tight_layout()

# Save plot
plt.savefig('output.png', dpi=150)
plt.close()
return 'output.png'
#+END_SRC

** Include Files

---start of README.md

#+INCLUDE: "README.md" :lines "1-10"

---end of README.md

* Conclusion

This comprehensive example demonstrates all the major org-mode elements that are styled by the theme. The combination of CSS variables, responsive design, and JavaScript functionality provides a modern, professional appearance for org-mode HTML exports.

Key features showcased:
- Light/dark theme toggle
- Copy-to-clipboard functionality for code blocks
- Responsive design for various screen sizes
- Comprehensive styling for all org-mode elements
- Professional typography and spacing

* Footnotes

[fn:1] This is the first footnote with some explanatory text.

[fn:2] This is the second footnote that provides additional context.
