example.html
<li><a id="orgc893443"></a>Quantum Computing&#xa0;&#xa0;&#xa0;<span class="tag"><span class="quantum">quantum</span></span><br />
<div class="outline-text-4" id="text-orgc893443">
<p>
Exploring quantum algorithms and applications.
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org56daac7" class="outline-2">
<h2 id="org56daac7">Special Elements</h2>
<div class="outline-text-2" id="text-org56daac7">
</div>
<div id="outline-container-org971fd12" class="outline-3">
<h3 id="org971fd12">Source Code References</h3>
<div class="outline-text-3" id="text-org971fd12">
<p>
Here&rsquo;s how to reference code: see line 42 in <code class="src src-python">fibonacci.py</code> 
</p>
</div>
</div>
<div id="outline-container-org8063a5c" class="outline-3">
<h3 id="org8063a5c">Mathematical Expressions</h3>
<div class="outline-text-3" id="text-org8063a5c">
<p>
The quadratic formula: \(x = \frac{-b \pm \sqrt{b^2 - 4ac}}{2a}\)
</p>

<p>
Block equation:
\[\int_{-\infty}^{\infty} e^{-x^2} dx = \sqrt{\pi}\]
</p>
</div>
</div>
<div id="outline-container-org2d43754" class="outline-3">
<h3 id="org2d43754">Keyboard Shortcuts</h3>
<div class="outline-text-3" id="text-org2d43754">
<ul class="org-ul">
<li>Save file: <code>C-x C-s</code></li>
<li>Export to HTML: <code>C-c C-e h h</code></li>
<li>Toggle theme: Click the 🌙/☀️ button</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org053e394" class="outline-2">
<h2 id="org053e394">Advanced Features</h2>
<div class="outline-text-2" id="text-org053e394">
</div>
<div id="outline-container-org62835c1" class="outline-3">
<h3 id="org62835c1">Property Drawers</h3>
<div class="outline-text-3" id="text-org62835c1">
</div>
<ul class="org-ul">
<li><a id="config"></a>Configuration Settings<br />
<div class="outline-text-4" id="text-config">
</div>
</li>
</ul>
</div>
<div id="outline-container-org14ba166" class="outline-3">
<h3 id="org14ba166">Source Code Blocks with Options</h3>
<div class="outline-text-3" id="text-org14ba166">
<div class="org-src-container">
<pre class="src src-python" id="org09e3110"><span style="color: #10b1fe;">import</span> pandas <span style="color: #10b1fe;">as</span> pd
<span style="color: #10b1fe;">import</span> matplotlib.pyplot <span style="color: #10b1fe;">as</span> plt

<span style="color: #7a808b;"># </span><span style="color: #7a808b;">Read data</span>
<span style="color: #8bcdef;">df</span> <span style="color: #7a82da;">=</span> pd.read_csv(data) <span style="color: #10b1fe;">if</span> data.endswith(<span style="color: #f9c859;">'.csv'</span>) <span style="color: #10b1fe;">else</span> pd.DataFrame({<span style="color: #f9c859;">'x'</span>: [<span style="color: #ff78f8; font-weight: bold;">1</span>,<span style="color: #ff78f8; font-weight: bold;">2</span>,<span style="color: #ff78f8; font-weight: bold;">3</span>], <span style="color: #f9c859;">'y'</span>: [<span style="color: #ff78f8; font-weight: bold;">4</span>,<span style="color: #ff78f8; font-weight: bold;">5</span>,<span style="color: #ff78f8; font-weight: bold;">6</span>]})

<span style="color: #7a808b;"># </span><span style="color: #7a808b;">Create visualization</span>
plt.figure(figsize<span style="color: #7a82da;">=</span>(<span style="color: #ff78f8; font-weight: bold;">8</span>, <span style="color: #ff78f8; font-weight: bold;">6</span>))
plt.plot(df.index, df.iloc[:, <span style="color: #ff78f8; font-weight: bold;">0</span>], <span style="color: #f9c859;">'b-'</span>, label<span style="color: #7a82da;">=</span><span style="color: #f9c859;">'Data'</span>)
plt.xlabel(<span style="color: #f9c859;">'Index'</span>)
plt.ylabel(<span style="color: #f9c859;">'Value'</span>)
plt.title(<span style="color: #f9c859;">'Data Visualization'</span>)
plt.legend()
plt.grid(<span style="color: #9f7efe;">True</span>, alpha<span style="color: #7a82da;">=</span><span style="color: #ff78f8; font-weight: bold;">0.3</span>)
plt.tight_layout()

<span style="color: #7a808b;"># </span><span style="color: #7a808b;">Save plot</span>
plt.savefig(<span style="color: #f9c859;">'output.png'</span>, dpi<span style="color: #7a82da;">=</span><span style="color: #ff78f8; font-weight: bold;">150</span>)
plt.close()
<span style="color: #10b1fe;">return</span> <span style="color: #f9c859;">'output.png'</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6c4a9b2" class="outline-2">
<h2 id="org6c4a9b2">Conclusion</h2>
<div class="outline-text-2" id="text-org6c4a9b2">
<p>
This comprehensive example demonstrates all the major org-mode elements that are styled by the theme. The combination of CSS variables, responsive design, and JavaScript functionality provides a modern, professional appearance for org-mode HTML exports.
</p>

<p>
Key features showcased:
</p>
<ul class="org-ul">
<li>Light/dark theme toggle</li>
<li>Copy-to-clipboard functionality for code blocks</li>
<li>Responsive design for various screen sizes</li>
<li>Comprehensive styling for all org-mode elements</li>
<li>Professional typography and spacing</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
This is the first footnote with some explanatory text.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
This is the second footnote that provides additional context.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2025-07-06 Sunday</p>
<p class="author">Author: ChongChong He</p>
<p class="date">Created: 2025-07-06 Sun 02:11</p>
</div>
</body>
</html>
